ONVIF-SIM/fakecamera/dis.xml

<?xml version="1.0" encoding="UTF-8"?><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:d="http://schemas.xmlsoap.org/ws/2005/04/discovery" xmlns:dn="http://www.onvif.org/ver10/network/wsdl"><s:Header><a:Action s:mustUnderstand="1">http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches</a:Action><a:MessageID>8247b2e7-92fe-4cc9-9dd9-0c8267007273</a:MessageID><a:RelatesTo>uuid:a566fea8-6912-49b3-b0fc-7ba583ca15ab</a:RelatesTo><a:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:To></s:Header><s:Body><d:ProbeMatches><d:ProbeMatch><a:EndpointReference><a:Address>urn:uuid:2bfaffd1-6a02-4394-9d26-816c9f6e0905</a:Address></a:EndpointReference><d:Types>dn:NetworkVideoTransmitter</d:Types><d:Scopes>onvif://www.onvif.org/name/Videonetics_Camera_Emulator onvif://www.onvif.org/manufacturer/Videonetics onvif://www.onvif.org/hardware/VMS onvif://www.onvif.org/location/India onvif://www.onvif.org/profile/streaming onvif://www.onvif.org/type/video_encoder</d:Scopes><d:XAddrs>http://172.21.64.16:7000/onvif/device_service</d:XAddrs><d:MetadataVersion>1</d:MetadataVersion></d:ProbeMatch></d:ProbeMatches></s:Body></s:Envelope>